---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrRange
source: html/8c31136c-2bb4-ff68-0ef7-0b1c9f837fd1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrRange Property

"Data Range"

## Syntax (C#)
```csharp
public static ForgeTypeId SpatialFieldMgrRange { get; }
```